In [ ]:
import pandas as pd

In [2]:
customers = pd.read_csv("customers.csv")
orders = pd.read_csv("orders.csv")
order_items = pd.read_csv("order_items.csv")

In [ ]:
recent_orders = orders[orders["order_date"] > "2024-02-14"]
recent_orders.head()

    order_id  customer_id  order_date
1       5002         1045  2024-02-20
5       5006         1031  2024-03-10
7       5008         1061  2024-03-08
9       5010         1054  2024-03-24
12      5013         1074  2024-02-16

In [11]:
ny_customers = customers[customers["city"].str.strip().str.lower().isin(["new york", "nyc"])]
ny_customers.head()

    customer_id first_name last_name      city
0          1001       Evan     Smith  New York
3          1004      Aisha     Smith  new york
5          1006       Evan     Patel  new york
7          1008      Maria     Smith       NYC
10         1011        Ben     Davis  New York

In [15]:
customers.sort_values("last_name")

     customer_id first_name last_name         city
31          1032       Noah     Brown           LA
112         1113      Maria     Brown          NYC
97          1098        Zoe      Chen           LA
53          1054        Zoe     Davis     New York
32          1033       alex     Davis      chicago
..           ...        ...       ...          ...
104         1105       Alex    Wilson     new york
68          1069     Taylor    Wilson          NYC
71          1072     Taylor    Wilson           LA
40          1041       Evan    Wilson  Los Angeles
59          1060     Jordan    Wilson          NYC

[120 rows x 4 columns]

In [18]:
order_items[order_items['quantity'] >= 2]

     order_id product_name  quantity  unit_price
0        5311      Monitor         3         300
1        5303     Keyboard         3          70
2        5012     Keyboard         3          70
3        5318      Monitor         3         300
6        5339    Desk Lamp         2          45
..        ...          ...       ...         ...
891      5021    Desk Lamp         2          45
893      5107      Monitor         3         300
895      5303    USB Cable         2          10
896      5117      Monitor         2         300
898      5399    USB Cable         2          10

[464 rows x 4 columns]

In [19]:
city_standartization_mapping = {'LA': 'Los Angeles', 'NYC': 'New York'}

In [20]:
customers["city"].replace(city_standartization_mapping)

0         New York
1          chicago
2      Los Angeles
3         new york
4      Los Angeles
          ...
115        Chicago
116    Los Angeles
117       New York
118        chicago
119        chicago
Name: city, Length: 120, dtype: object

Using .apply()

In [21]:
customers["clean_last_name"] = customers["last_name"].apply(
    lambda x:
    x.strip()
)

In [22]:
customers["clean_last_name"].value_counts()

clean_last_name
Davis       19
Smith       18
Patel       17
Brown       16
Chen        16
Anderson    13
Wilson      13
Lopez        8
Name: count, dtype: int64

In [24]:
order_items["total_price"] = order_items["quantity"] * order_items["unit_price"]

In [25]:
order_items

     order_id product_name  quantity  unit_price  total_price
0        5311      Monitor         3         300          900
1        5303     Keyboard         3          70          210
2        5012     Keyboard         3          70          210
3        5318      Monitor         3         300          900
4        5080    USB Cable         1          10           10
..        ...          ...       ...         ...          ...
895      5303    USB Cable         2          10           20
896      5117      Monitor         2         300          600
897      5124     Keyboard         1          70           70
898      5399    USB Cable         2          10           20
899      5281      Monitor         1         300          300

[900 rows x 5 columns]

Merging tables

In [26]:
orders_with_customers = orders.merge(customers, how ="inner")
orders_with_customers.head()

,order_id,customer_id,order_date,first_name,last_name,city,clean_last_name
0,5001,1089,2024-01-26,Aisha,Smith,NYC,Smith
1,5002,1045,2024-02-20,Priya,Davis,NYC,Davis
2,5003,1004,2024-02-14,Aisha,Smith,new york,Smith
3,5004,1036,2024-02-13,Chloe,Davis,New York,Davis
4,5005,1070,2024-01-05,jordan,Brown,LA,Brown

In [31]:
orders_customers_items = orders_with_customers.merge(order_items, on = "order_id", how = "inner")
orders_customers_items.head()

,order_id,customer_id,order_date,first_name,last_name,city,clean_last_name,product_name,quantity,unit_price,total_price
0,5001,1089,2024-01-26,Aisha,Smith,NYC,Smith,Monitor,1,300,300
1,5001,1089,2024-01-26,Aisha,Smith,NYC,Smith,Desk Lamp,2,45,90
2,5001,1089,2024-01-26,Aisha,Smith,NYC,Smith,Desk Lamp,1,45,45
3,5002,1045,2024-02-20,Priya,Davis,NYC,Davis,Monitor,2,300,600
4,5002,1045,2024-02-20,Priya,Davis,NYC,Davis,Monitor,2,300,600

In [34]:
combined = (
    orders.merge(customers, on="customer_id", how="inner").merge(order_items, on="order_id", how="inner")
)
combined

,order_id,customer_id,order_date,first_name,last_name,city,clean_last_name,product_name,quantity,unit_price,total_price
0,5001,1089,2024-01-26,Aisha,Smith,NYC,Smith,Monitor,1,300,300
1,5001,1089,2024-01-26,Aisha,Smith,NYC,Smith,Desk Lamp,2,45,90
2,5001,1089,2024-01-26,Aisha,Smith,NYC,Smith,Desk Lamp,1,45,45
3,5002,1045,2024-02-20,Priya,Davis,NYC,Davis,Monitor,2,300,600
4,5002,1045,2024-02-20,Priya,Davis,NYC,Davis,Monitor,2,300,600
...,...,...,...,...,...,...,...,...,...,...,...
895,5450,1008,2024-02-26,Maria,Smith,NYC,Smith,Laptop,2,1200,2400
896,5450,1008,2024-02-26,Maria,Smith,NYC,Smith,Keyboard,3,70,210
897,5450,1008,2024-02-26,Maria,Smith,NYC,Smith,USB Cable,2,10,20
898,5450,1008,2024-02-26,Maria,Smith,NYC,Smith,Mouse,3,25,75
899,5450,1008,2024-02-26,Maria,Smith,NYC,Smith,Monitor,2,300,600

In [ ]:
'''
order_items.groupby("product_name").agg(
    total_revenue=("")

)
'''

Reshaping Data

In [39]:
sample = combined[["customer_id", "product_name", "total_price"]].head(12)
sample

    customer_id product_name  total_price
0          1089      Monitor          300
1          1089    Desk Lamp           90
2          1089    Desk Lamp           45
3          1045      Monitor          600
4          1045      Monitor          600
5          1004     Keyboard          140
6          1004    Desk Lamp          135
7          1004       Laptop         2400
8          1004    USB Cable           20
9          1036        Mouse           50
10         1036    USB Cable           10
11         1036    USB Cable           10

In [ ]:
pivot = sample.pivot_table(index="customer_id", columns = "product_name", values="total_price", aggfunc="sum")
pivot

product_name  Desk Lamp  Keyboard  Laptop  Monitor  Mouse  USB Cable
customer_id
1004              135.0     140.0  2400.0      NaN    NaN       20.0
1036                NaN       NaN     NaN      NaN   50.0       20.0
1045                NaN       NaN     NaN   1200.0    NaN        NaN
1089              135.0       NaN     NaN    300.0    NaN        NaN